src/cf/src/DataProcessors/АРМЗакупки/АРМЗакупки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>АРМЗакупки</name>
  <comment>Рабочее место менеджера по закупкам: заказы поставщикам, их поставка и оплата (docs/plans/arm-purchasing.md).</comment>
</mdclass:DataProcessor>

src/cf/src/Documents/ЗаказПоставщику/ЗаказПоставщику.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаказПоставщику</name>
  <basedOn>Document.ЗаказПокупателя</basedOn>
  <basedOn>Document.ПредложениеПоставщика</basedOn>
  <registerRecords>AccumulationRegister.ЗаказыПоставщикам</registerRecords>
  <registerRecords>AccumulationRegister.ПотребностиПроизводства</registerRecords>
  <attributes>
    <name>ВидЗаказа</name>
    <type>
      <types>EnumRef.ВидыЗаказовПоставщику</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПоставки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыСКонтрагентами</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>DefinedType.Комментарий</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаНДС</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаБезНДС</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаВключаетНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВВалюте</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>КурсВалюты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаРегл</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТЧТовары</name>
    <attributes>
      <name>ЗаказПоставщику</name>
      <type>
        <types>DocumentRef.ЗаказПоставщику</types>
      </type>
    </attributes>
    <attributes>
      <name>КодСтроки</name>
      <type>
        <types>DefinedType.КодСтроки</types>
      </type>
    </attributes>
    <attributes>
      <name>НоменклатураКонтрагента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСНДС</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>CatalogRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>DefinedType.Комментарий</types>
      </type>
    </attributes>
    <attributes>
      <name>Продукция</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаРегл</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/cf/src/DataProcessors/АРМЗакупки/Forms/Форма/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Элементы.НадписьЛегенда.Заголовок = Обработки.АРМЗакупки.ЛегендаИндикатораСтрокой();
	НомерСтраницы = 1;
	ПрименитьСостояниеПанели(ЭтотОбъект);
	ЗагрузитьСтраницуНаСервере();
	ЗагрузитьДанныеЗаказа(?(Заказы.Количество() = 0, Неопределено, Заказы[0].Заказ));

КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)

	// Сохранённое состояние панели восстанавливается после ПриСозданииНаСервере.
	ПрименитьСостояниеПанели(ЭтотОбъект);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Отборы панели фильтров: список перечитывается с первой страницы.
//
// Параметры:
//  Элемент - ПолеФормы - изменённое поле фильтра.
//
&НаКлиенте
Процедура ОтборПриИзменении(Элемент)

	НомерСтраницы = 1;
	ЗагрузитьСтраницу();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыЗаказы

&НаКлиенте
Процедура ЗаказыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	СтрокаТаблицы = Элемент.ТекущиеДанные;
	Если СтрокаТаблицы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Если Поле = Элементы.ЗаказыЗаказКлиента И ЗначениеЗаполнено(СтрокаТаблицы.ЗаказКлиента) Тогда
		ОткрытьДокумент(СтрокаТаблицы.ЗаказКлиента);
	Иначе
		ОткрытьДокумент(СтрокаТаблицы.Заказ);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЗаказыПриАктивизацииСтроки(Элемент)

	ЗадержкаСекунд = 0.2;
	ПодключитьОбработчикОжидания("ОбновитьТекущийЗаказ", ЗадержкаСекунд, Истина);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПоступления

&НаКлиенте
Процедура ПоступленияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	ОткрытьДокументСтроки(Элемент, Поле, СтандартнаяОбработка);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыОплаты

&НаКлиенте
Процедура ОплатыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	ОткрытьДокументСтроки(Элемент, Поле, СтандартнаяОбработка);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДокументы

&НаКлиенте
Процедура ДокументыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	ОткрытьДокументСтроки(Элемент, Поле, СтандартнаяОбработка);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Создать(Команда)

	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияДокумента", ЭтотОбъект);
	ЗначенияЗаполнения = Новый Структура;
	Если ЗначениеЗаполнено(ОтборПоставщик) Тогда
		ЗначенияЗаполнения.Вставить("Контрагент", ОтборПоставщик);
	КонецЕсли;
	ОткрытьФорму("Документ.ЗаказПоставщику.ФормаОбъекта", Новый Структура("ЗначенияЗаполнения", ЗначенияЗаполнения),
		ЭтотОбъект, , , , Оповещение);

КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)

	ЗагрузитьСтраницу();

КонецПроцедуры

&НаКлиенте
Процедура СвернутьПанель(Команда)

	ПанельРазвернута = Ложь;
	ПрименитьСостояниеПанели(ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура РазвернутьПанель(Команда)

	ПанельРазвернута = Истина;
	ПрименитьСостояниеПанели(ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура ПоказатьФильтры(Команда)

	ПанельРазвернута = Истина;
	ПрименитьСостояниеПанели(ЭтотОбъект);
	Элементы.ГруппаСтраницыСведений.ТекущаяСтраница = Элементы.СтраницаФильтры;

КонецПроцедуры

&НаКлиенте
Процедура СтраницаПервая(Команда)

	Если НомерСтраницы > 1 Тогда
		НомерСтраницы = 1;
		ЗагрузитьСтраницу();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СтраницаНазад(Команда)

	Если НомерСтраницы > 1 Тогда
		НомерСтраницы = НомерСтраницы - 1;
		ЗагрузитьСтраницу();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СтраницаВперед(Команда)

	Если НомерСтраницы < ВсегоСтраниц Тогда
		НомерСтраницы = НомерСтраницы + 1;
		ЗагрузитьСтраницу();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СтраницаПоследняя(Команда)

	Если НомерСтраницы < ВсегоСтраниц Тогда
		НомерСтраницы = ВсегоСтраниц;
		ЗагрузитьСтраницу();
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Перечитывает страницу заказов и нижние закладки текущего заказа; текущий заказ сохраняется, если он остался на странице.
&НаКлиенте
Процедура ЗагрузитьСтраницу()

	ЗагрузитьСтраницуНаСервере();
	ОбновитьТекущийЗаказ();

КонецПроцедуры

&НаСервере
Процедура ЗагрузитьСтраницуНаСервере()

	Страница = Обработки.АРМЗакупки.СтраницаЗаказов(ОтборыПанели(), НомерСтраницы, РазмерСтраницыЗаказов());
	НомерСтраницы = Страница.НомерСтраницы;
	ВсегоСтраниц = Страница.ВсегоСтраниц;
	Заказы.Очистить();
	Для Каждого СтрокаЗаказа Из Страница.Строки Цикл
		ЗаполнитьЗначенияСвойств(Заказы.Добавить(), СтрокаЗаказа);
	КонецЦикла;
	РаботаСДокументамиКлиентСервер.ОбновитьПагинатор(ЭтотОбъект, НомерСтраницы, ВсегоСтраниц, РазмерСтраницыЗаказов(),
		Страница.Всего);
	// Курсор остаётся на прежнем заказе, если тот на странице; иначе - первая строка.
	Найденные = Заказы.НайтиСтроки(Новый Структура("Заказ", ТекущийЗаказ));
	Если Найденные.Количество() > 0 Тогда
		Элементы.Заказы.ТекущаяСтрока = Найденные[0].ПолучитьИдентификатор();
	ИначеЕсли Заказы.Количество() > 0 Тогда
		Элементы.Заказы.ТекущаяСтрока = Заказы[0].ПолучитьИдентификатор();
	Иначе
		Элементы.Заказы.ТекущаяСтрока = Неопределено;
	КонецЕсли;

КонецПроцедуры

// Нижние закладки - по текущему заказу верхней таблицы; при неизменном заказе перечитываются (после записи документов).
&НаКлиенте
Процедура ОбновитьТекущийЗаказ()

	СтрокаТаблицы = Элементы.Заказы.ТекущиеДанные;
	Заказ = ?(СтрокаТаблицы = Неопределено, Неопределено, СтрокаТаблицы.Заказ);
	ЗагрузитьДанныеЗаказа(Заказ);

КонецПроцедуры

&НаСервере
Процедура ЗагрузитьДанныеЗаказа(Знач Заказ)

	ТекущийЗаказ = Заказ;
	Товары.Очистить();
	Поступления.Очистить();
	Оплаты.Очистить();
	Документы.Очистить();
	Элементы.НадписьСальдо.Заголовок = "";
	Если Не ЗначениеЗаполнено(Заказ) Тогда
		Возврат;
	КонецЕсли;
	Данные = Обработки.АРМЗакупки.ДанныеЗаказа(Заказ);
	Товары.Загрузить(Данные.Товары);
	Поступления.Загрузить(Данные.Поступления);
	Оплаты.Загрузить(Данные.Оплаты);
	Документы.Загрузить(Данные.Документы);
	Элементы.НадписьСальдо.Заголовок = Данные.Сальдо;

КонецПроцедуры

&НаСервере
Функция ОтборыПанели()

	Отборы = Обработки.АРМЗакупки.НовыеОтборы();
	Отборы.Поставщик = ОтборПоставщик;
	Отборы.Товар = ОтборТовар;
	Отборы.Статус = ОтборСтатус;
	Отборы.ПериодПоставки = ОтборПериодПоставки;
	Отборы.Ответственный = ОтборОтветственный;
	Отборы.ВидЗаказа = ОтборВидЗаказа;
	Возврат Отборы;

КонецФункции

// Возвращаемое значение:
//  Число - заказов на странице списка.
//
&НаСервере
Функция РазмерСтраницыЗаказов()

	// BSLLS:MagicNumber-off - размер страницы, как в формах списков документов.
	Возврат 50;
	// BSLLS:MagicNumber-on

КонецФункции

// Свёрнутая панель - столбик значков, развёрнутая - страница фильтров с кнопкой свернуть внизу, как в списках документов.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - рабочее место.
//
&НаКлиентеНаСервереБезКонтекста
Процедура ПрименитьСостояниеПанели(Форма)

	ЭлементыФормы = Форма.Элементы;
	ЭлементыФормы.ГруппаПанельЗначки.Видимость = Не Форма.ПанельРазвернута;
	ЭлементыФормы.ГруппаСтраницыСведений.Видимость = Форма.ПанельРазвернута;
	ЭлементыФормы.ГруппаПодвалПанели.Видимость = Форма.ПанельРазвернута;

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьДокументСтроки(Элемент, Поле, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	СтрокаТаблицы = Элемент.ТекущиеДанные;
	Если СтрокаТаблицы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Если Элемент = Элементы.Оплаты И Поле = Элементы.ОплатыОснование Тогда
		ОткрытьДокумент(СтрокаТаблицы.Основание);
	Иначе
		ОткрытьДокумент(СтрокаТаблицы.Документ);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьДокумент(Ссылка)

	Если Не ЗначениеЗаполнено(Ссылка) Тогда
		Возврат;
	КонецЕсли;
	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияДокумента", ЭтотОбъект);
	ОткрытьФорму(ИмяФормыОбъекта(Ссылка), Новый Структура("Ключ", Ссылка), ЭтотОбъект, , , , Оповещение);

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияДокумента(Результат, ДопПараметры) Экспорт

	ЗагрузитьСтраницу();

КонецПроцедуры

&НаСервереБезКонтекста
Функция ИмяФормыОбъекта(Знач Ссылка)

	Возврат Ссылка.Метаданные().ПолноеИмя() + ".ФормаОбъекта";

КонецФункции

#КонецОбласти
